app/controllers/basket_items_controller.rb

SELECT  `basket_items`.* FROM `basket_items` WHERE `basket_items`.`order_id` = 2 AND `basket_items`.`product_id` = 1  ORDER BY `basket_items`.`id` ASC LIMIT 1
INSERT INTO `basket_items` (`quantity`, `product_id`, `order_id`, `unit_price`, `total_price`, `created_at`, `updated_at`) VALUES (1, 1, 1, 49.99, 49.99, '2016-12-11 17:02:39', '2016-12-11 17:02:39')
INSERT INTO `orders` (`subtotal`, `created_at`, `updated_at`, `order_status_id`) VALUES (49.99, '2016-12-11 17:02:39', '2016-12-11 17:02:39', 1)
UPDATE `basket_items` SET `quantity` = 2, `total_price` = 159.98, `updated_at` = '2016-12-12 20:44:05' WHERE `basket_items`.`id` = 44
UPDATE `orders` SET `subtotal` = 129.98, `updated_at` = '2016-12-11 17:11:44' WHERE `orders`.`id` = 3
---
  def create
    @order = current_order
    # Below code has been changed from the original to allow a quantity to update if a product is added twice
    # Credit to Dominic for the solution
    @basket_item = @order.basket_items.where(:product_id => basket_item_params[:product_id]).first
    if (@basket_item == nil)
      @basket_item = @order.basket_items.new(basket_item_params)
    else
      @basket_item.quantity += basket_item_params[:quantity].to_i
      @basket_item.save

SELECT  `basket_items`.* FROM `basket_items` WHERE `basket_items`.`order_id` = 3 AND `basket_items`.`id` = 3 LIMIT 1
UPDATE `basket_items` SET `quantity` = 2, `total_price` = 159.98, `updated_at` = '2016-12-11 17:20:32' WHERE `basket_items`.`id` = 3
---
  def update
    @order = current_order
    @basket_item = @order.basket_items.find(params[:id])
    @basket_item.update_attributes(basket_item_params)

SELECT  `basket_items`.* FROM `basket_items` WHERE `basket_items`.`order_id` = 3 AND `basket_items`.`id` = 3 LIMIT 1
DELETE FROM `basket_items` WHERE `basket_items`.`id` = 3
---
  def destroy
    @order = current_order
    @basket_item = @order.basket_items.find(params[:id])
    @basket_item.destroy

DELETE FROM `basket_items` WHERE `basket_items`.`id` = 54
---
  def destroy_all
    @order = current_order
    @basket_items = @order.basket_items
    @basket_items.clear