app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT `product_categories`.* FROM `product_categories`