app/controllers/products_controller.rb

SELECT `product_categories`.* FROM `product_categories`  ORDER BY name ASC
---
  def new
    @product = Product.new
    @product_categories = ProductCategory.order('name ASC')

SELECT `product_categories`.* FROM `product_categories`  ORDER BY name ASC
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
        format.html { redirect_to @product, notice: 'Product was successfully created.' }
        format.json { render :show, status: :created, location: @product }
      else
        @product_categories = ProductCategory.order('name ASC')