app/controllers/store_controller.rb

  def index
  	@products = Product.all
    @basket_item = current_order.basket_items.new
    @order = current_order
    @basket_items = @order.basket_items
    @product_categories = ProductCategory.all
---
SELECT  `product_categories`.* FROM `product_categories`  ORDER BY `product_categories`.`id` DESC LIMIT 1