app/views/layouts/_cart_text.html.erb

<% booking = current_booking
   basket_size = current_order.basket_items.size
---
SELECT  `basket_items`.* FROM `basket_items` WHERE `basket_items`.`order_id` = 3 AND `basket_items`.`id` = 5 LIMIT 1
SELECT COUNT(*) FROM `basket_items` WHERE `basket_items`.`order_id` = 3